Semester-7/Технология разработки прикладных решений 1С/lab4/src/DataProcessors/СервисныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОперации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab4/src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab4/src/DataProcessors/СервисныеОперации/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка «Сервисные операции».
//
// Команды соответствуют разделам части 2 учебного пособия Семёнова,
// доработки — заданиям 3–9 курса. Имена серверных процедур совпадают
// с теми, что фигурируют в формулировках заданий.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедуры

&НаКлиенте
Функция КатегорияУказана()

	Если НЕ ЗначениеЗаполнено(КатегорияТоваров) Тогда
		Сообщить("Укажите категорию товаров.");
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ЗаменаЦветаИСтраны

// Задание 3. Цвет заменяется только у товаров выбранной категории.
// В поле выбора категории разрешён выбор только групп, элемент указать нельзя.
&НаСервереБезКонтекста
Процедура ЗаменаЦветаНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.ЦветТовара) = "Зеленый" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.ЦветТовара = Справочники.ЦветаТоваров.НайтиПоКоду("Красный");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменен зеленый цвет на красный.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров зелёного цвета не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаЦвета(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаЦветаНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

// Задание 3. Страна заменяется только у товаров выбранной категории.
&НаСервереБезКонтекста
Процедура ЗаменаСтраныНаСервере(Категория)

	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
	Заменено = 0;

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если СокрЛП(ВыборкаТоваров.СтранаТовара) = "Китай" Тогда
			ТекущийТовар = ВыборкаТоваров.Ссылка.ПолучитьОбъект();
			ТекущийТовар.СтранаТовара = Справочники.СтраныТоваров.НайтиПоКоду("Россия");
			ТекущийТовар.Записать();
			Заменено = Заменено + 1;
			Сообщить("Для товара " + ТекущийТовар.Наименование + " заменена страна Китай на Россию.");
		КонецЕсли;
	КонецЦикла;

	Если Заменено = 0 Тогда
		Сообщить("В категории " + Категория + " товаров из Китая не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСтраны(Команда)

	Если КатегорияУказана() Тогда
		ЗаменаСтраныНаСервере(КатегорияТоваров);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СозданиеГруппы

// Задание 4, пункт 1. Перед созданием проверяем, нет ли уже группы с таким именем.
&НаСервереБезКонтекста
Процедура СоздатьГруппуНаСервере(ИмяГруппы)

	СуществующаяГруппа = Справочники.Товары.НайтиПоНаименованию(СокрЛП(ИмяГруппы), Истина);

	Если НЕ СуществующаяГруппа.Пустая() И СуществующаяГруппа.ЭтоГруппа Тогда
		Сообщить("Группа «" + СокрЛП(ИмяГруппы) + "» уже существует, новая не создана.");
		Возврат;
	КонецЕсли;

	НоваяГруппаТоваров = Справочники.Товары.СоздатьГруппу();
	НоваяГруппаТоваров.Наименование = СокрЛП(ИмяГруппы);
	НоваяГруппаТоваров.Записать();
	Сообщить("Создана группа «" + СокрЛП(ИмяГруппы) + "».");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)

	Если НЕ ЗначениеЗаполнено(НоваяГруппа) Тогда
		Сообщить("Укажите имя новой группы.");
		Возврат;
	КонецЕсли;
	СоздатьГруппуНаСервере(НоваяГруппа);

КонецПроцедуры

#КонецОбласти

#Область УдалениеТовара

// Задание 4, пункт 2. Перед удалением показываем, в каких документах есть ссылки на товар.
&НаСервереБезКонтекста
Процедура УдалитьТоварНаСервере(Товар)

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Товар);
	НайденныеСсылки = НайтиПоСсылкам(МассивСсылок);

	Если НайденныеСсылки.Количество() > 0 Тогда
		Сообщить("На товар «" + Товар + "» есть ссылки в следующих объектах:");
		Для Каждого СтрокаСсылки Из НайденныеСсылки Цикл
			Сообщить("    " + СтрокаСсылки.Метаданные + ": " + СтрокаСсылки.Данные);
		КонецЦикла;
		Сообщить("Товар помечен на удаление, но не удалён физически.");
		ОбъектТовара = Товар.ПолучитьОбъект();
		ОбъектТовара.УстановитьПометкуУдаления(Истина);
		Возврат;
	КонецЕсли;

	ОбъектТовара = Товар.ПолучитьОбъект();
	ОбъектТовара.Удалить();
	Сообщить("Товар «" + Товар + "» удалён: ссылок на него не найдено.");

КонецПроцедуры

&НаКлиенте
Процедура УдалитьТовар(Команда)

	Если НЕ ЗначениеЗаполнено(ТоварДляУдаления) Тогда
		Сообщить("Укажите товар.");
		Возврат;
	КонецЕсли;
	УдалитьТоварНаСервере(ТоварДляУдаления);
	ТоварДляУдаления = Неопределено;

КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВТекстовыйФайл

// Задание 4, пункт 3. В выгрузку добавлены цвет и страна товара.
// Формат строки: Код;Наименование;Цвет;Страна
&НаСервереБезКонтекста
Процедура ВыгрузитьТекстНаСервере(Категория, ПутьФайла)

	Текст = Новый ТекстовыйДокумент;
	ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);

	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Текст.ДобавитьСтроку(СокрЛП(ВыборкаТоваров.Код) + ";"
			+ СокрЛП(ВыборкаТоваров.Наименование) + ";"
			+ СокрЛП(ВыборкаТоваров.ЦветТовара) + ";"
			+ СокрЛП(ВыборкаТоваров.СтранаТовара));
	КонецЦикла;

	Текст.Записать(ПутьФайла, КодировкаТекста.UTF8);
	Сообщить("Выгружено строк: " + Текст.КоличествоСтрок() + ". Файл: " + ПутьФайла);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТекст(Команда)

	Если НЕ КатегорияУказана() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Укажите путь к текстовому файлу.");
		Возврат;
	КонецЕсли;
	ВыгрузитьТекстНаСервере(КатегорияТоваров, ПутьКФайлу);

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзТекстовогоФайлаБазовая

// Базовый вариант из пособия: строка «Код;Наименование», цвет и страна не загружаются,
// проверка дублей — сравнением с товарами выбранной категории.
&НаСервереБезКонтекста
Процедура ЗагрузитьТекстНаСервере(Категория, ПутьФайла)

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ПутьФайла, КодировкаТекста.UTF8);

	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл

		ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерСтроки));
		Если ПустаяСтрока(ТекущаяСтрока) Тогда
			Продолжить;
		КонецЕсли;

		ПозицияРазделителя = СтрНайти(ТекущаяСтрока, ";");
		НаимТовара = СокрЛП(Сред(ТекущаяСтрока, ПозицияРазделителя + 1));

		ФлагЗадвойки = 0;
		ВыборкаТоваров = Справочники.Товары.Выбрать(Категория);
		Пока ВыборкаТоваров.Следующий() Цикл
			Если ВыборкаТоваров.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			Если СокрЛП(ВыборкаТоваров.Наименование) = НаимТовара Тогда
				Сообщить("Такой товар уже есть.");
				ФлагЗадвойки = 1;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ФлагЗадвойки = 0 Тогда
			НовыйТовар = Справочники.Товары.СоздатьЭлемент();
			НовыйТовар.Наименование = НаимТовара;
			НовыйТовар.Родитель = Категория;
			НовыйТовар.Записать();
			Сообщить("Товар " + НаимТовара + " загружен в категорию " + Категория);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТекст(Команда)

	Если НЕ КатегорияУказана() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Укажите путь к текстовому файлу.");
		Возврат;
	КонецЕсли;
	ЗагрузитьТекстНаСервере(КатегорияТоваров, ПутьКФайлу);

КонецПроцедуры

#КонецОбласти
